from string import Template
#### حوارات RAG ####

### النظام ###
system_prompt=Template("\n".join([
        "أنت مساعد ذكي لتوليد الردود للمستخدمين.",
        "سيتم تزويدك بمجموعة من المستندات مع استفسار المستخدم.",
        "قم بتوليد رد بناءً على المستندات المقدمة فقط. تجاهل أي مستندات لا علاقة لها باستفسار المستخدم.",
        "إذا لم تتمكن من توليد رد مناسب، يمكنك الاعتذار بلطف للمستخدم.",
        "يجب أن يكون ردك بنفس لغة استفسار المستخدم.",
        "كن مهذبًا ومحترمًا في تعاملك مع المستخدم.",
        "كن دقيقًا وموجزًا في ردودك، وتجنب المعلومات الزائدة عن الحاجة.",
]))

### المستند ###
document_prompt=Template("\n".join([
   "## المستند رقم: $doc_num",
   "### المحتوى: $chunk_text",
]))

### التذييل ###
footer_prompt=Template("\n".join(
    [
        "استنادًا فقط إلى المستندات أعلاه، يرجى إنشاء إجابة مناسبة للمستخدم.",
        "السؤال: $query",
         
        "##الإجابة:",
    ]
))